[
  {
    "id": "Q1.1",
    "dimensi": "Affordability (Keterjangkauan)",
    "skenario": "Anda berencana mengadakan ujian harian menggunakan platform kuis online yang interaktif. Sehari sebelum pelaksanaan, tiga orang tua siswa melapor tidak memiliki kuota internet untuk membuka aplikasi berat tersebut. Sekolah tidak menyediakan subsidi.",
    "pertanyaan": "Apa keputusan strategis yang paling inklusif yang Anda ambil?",
    "opsi": {
      "A": "Tetap melaksanakan kuis karena mayoritas siap, 3 siswa menyusul nanti.",
      "B": "Membatalkan kuis online, ganti soal teks via WA agar hemat.",
      "C": "Siswa berkuota pakai aplikasi, siswa terkendala diberi file 'mode ringan' atau diizinkan pakai WiFi sekolah bergilir.",
      "D": "Meminta siswa tersebut menumpang tethering ke teman rumahnya."
    },
    "poin": {
      "A": 1,
      "B": 2,
      "C": 5,
      "D": 3
    }
  },
  {
    "id": "Q1.2",
    "dimensi": "Affordability (Keterjangkauan)",
    "skenario": "Kepala sekolah meminta rekomendasi aplikasi perpustakaan digital. Pilihan X: Berbayar, konten bagus, berat. Pilihan Y: Gratis/Open Source, konten sederhana bisa diedit, ringan/offline. Mayoritas siswa ekonomi menengah ke bawah.",
    "pertanyaan": "Rekomendasi mana yang Anda berikan?",
    "opsi": {
      "A": "Pilih Y: Keberlanjutan akses seluruh siswa lebih penting daripada fitur canggih, dan guru bisa memperkaya konten.",
      "B": "Pilih X: Kualitas konten nomor satu, berharap nanti ada dana BOS.",
      "C": "Pilih X untuk uji coba sebulan, kalau tidak sanggup baru pindah ke Y.",
      "D": "Serahkan keputusan ke Kepala Sekolah agar aman."
    },
    "poin": {
      "A": 5,
      "B": 1,
      "C": 3,
      "D": 2
    }
  },
  {
    "id": "Q1.3",
    "dimensi": "Affordability (Keterjangkauan)",
    "skenario": "Anda menemukan video YouTube yang sangat bagus untuk materi IPA, tapi durasinya 1 jam (sangat boros kuota). Anda ingin siswa mempelajarinya di rumah.",
    "pertanyaan": "Tindakan mana yang paling peduli pada keterjangkauan?",
    "opsi": {
      "A": "Share link video dan mewajibkan siswa menonton sampai habis.",
      "B": "Mendownload video tersebut, memotong (cut) bagian pentingnya saja menjadi 5 menit, lalu membagikan file kecilnya ke grup kelas.",
      "C": "Merangkum isi video dalam bentuk teks panjang.",
      "D": "Meminta siswa mencari WiFi gratis di balai desa."
    },
    "poin": {
      "A": 1,
      "B": 5,
      "C": 3,
      "D": 2
    }
  },
  {
    "id": "Q2.1",
    "dimensi": "Cultural Inclusion (Inklusi Budaya)",
    "skenario": "Video pembelajaran animasi 'Musim Salju' digunakan untuk menjelaskan es mencair. Siswa Anda di pesisir tropis bingung membayangkan konteksnya.",
    "pertanyaan": "Bagaimana Anda memodifikasi pembelajaran ini?",
    "opsi": {
      "A": "Menjelaskan apa adanya, minta siswa menghafal salju = air beku.",
      "B": "Gunakan video sebagai pemantik saja, lalu ajak siswa praktek nyata membuat es lilin/es batu (konteks lokal).",
      "C": "Cari video lain berbahasa Indonesia meski kualitas animasi jelek.",
      "D": "Lewati materi perubahan wujud benda."
    },
    "poin": {
      "A": 2,
      "B": 5,
      "C": 3,
      "D": 1
    }
  },
  {
    "id": "Q2.2",
    "dimensi": "Cultural Inclusion (Inklusi Budaya)",
    "skenario": "Sebagian besar siswa kelas 1 SD Anda lebih fasih bahasa daerah daripada Bahasa Indonesia. Materi digital dari pusat semuanya Bahasa Indonesia baku.",
    "pertanyaan": "Strategi bridging (jembatan) apa yang Anda lakukan?",
    "opsi": {
      "A": "Larang bahasa daerah agar cepat lancar Bahasa Indonesia.",
      "B": "Metode Translanguaging: Jelaskan konsep pakai bahasa daerah dulu, baru kenalkan istilah Indonesianya.",
      "C": "Minta orang tua ajari Bahasa Indonesia di rumah.",
      "D": "Ulang video berkali-kali sampai paham."
    },
    "poin": {
      "A": 1,
      "B": 5,
      "C": 3,
      "D": 2
    }
  },
  {
    "id": "Q2.3",
    "dimensi": "Cultural Inclusion (Inklusi Budaya)",
    "skenario": "Ada aplikasi membaca yang bagus, tapi tokoh-tokoh ceritanya bernama asing (Jack, Alice) dan kegiatannya (pesta Halloween) asing bagi budaya siswa Anda.",
    "pertanyaan": "Cara terbaik memanfaatkan aplikasi ini?",
    "opsi": {
      "A": "Gunakan saja karena itu mengenalkan budaya global.",
      "B": "Saat menceritakan ulang di kelas, Anda mengganti nama tokoh menjadi (Budi, Siti) dan konteks kegiatannya disesuaikan budaya lokal secara lisan.",
      "C": "Tidak jadi pakai aplikasi tersebut.",
      "D": "Menyuruh siswa membayangkan mereka sedang di luar negeri."
    },
    "poin": {
      "A": 2,
      "B": 5,
      "C": 1,
      "D": 3
    }
  },
  {
    "id": "Q3.1",
    "dimensi": "Wellbeing & Safety (Kesejahteraan)",
    "skenario": "Beredar stiker wajah siswa yang diedit mengejek di grup WA kelas. Korban mogok sekolah. Pelaku adalah siswa populer.",
    "pertanyaan": "Tindakan pedagogis digital Anda?",
    "opsi": {
      "A": "Marahi pelaku di depan kelas dan keluarkan dari grup.",
      "B": "Tutup grup WA kelas selamanya.",
      "C": "Pendekatan restoratif: Panggil pelaku & korban terpisah, fasilitasi maaf, lalu ajarkan 'Etika Digital' ke seluruh kelas.",
      "D": "Minta pelaku hapus stiker dan minta maaf di chat."
    },
    "poin": {
      "A": 1,
      "B": 2,
      "C": 5,
      "D": 3
    }
  },
  {
    "id": "Q3.2",
    "dimensi": "Wellbeing & Safety (Kesejahteraan)",
    "skenario": "Orang tua sering Video Call ke nomor pribadi Anda malam hari untuk tanya tugas. Privasi terganggu.",
    "pertanyaan": "Bagaimana menegakkan batas profesional?",
    "opsi": {
      "A": "Buat kesepakatan tertulis 'Jam Komunikasi' (misal 07.00-15.00), konsisten tidak angkat di luar jam itu (kecuali darurat), balas besok paginya.",
      "B": "Angkat dengan nada ketus agar mereka sadar.",
      "C": "Blokir nomor yang sering nelpon malam.",
      "D": "Tetap layani 24 jam sebagai pengabdian."
    },
    "poin": {
      "A": 5,
      "B": 3,
      "C": 1,
      "D": 2
    }
  },
  {
    "id": "Q3.3",
    "dimensi": "Wellbeing & Safety (Kesejahteraan)",
    "skenario": "Siswa mengeluh pusing dan lelah mata karena setiap hari zoom meeting 4 jam berturut-turut tanpa jeda.",
    "pertanyaan": "Evaluasi desain pembelajaran Anda?",
    "opsi": {
      "A": "Kurangi durasi tatap muka (sinkron) jadi 1 jam saja untuk diskusi inti, sisanya aktivitas mandiri (asinkron) offline.",
      "B": "Suruh siswa minum obat sakit kepala dan tetap ikut zoom.",
      "C": "Memberi jam istirahat 5 menit setiap 2 jam.",
      "D": "Mengganti zoom dengan tugas menulis 10 halaman."
    },
    "poin": {
      "A": 5,
      "B": 1,
      "C": 3,
      "D": 2
    }
  },
  {
    "id": "Q4.1",
    "dimensi": "Empowered Agency (Agensi Guru)",
    "skenario": "Sekolah hanya punya 1 proyektor LCD dan tidak ada lab komputer. Anda ingin mengajar berbasis digital.",
    "pertanyaan": "Sikap agensi mana yang Anda tunjukkan?",
    "opsi": {
      "A": "Kembali pakai papan tulis sampai alat dibeli.",
      "B": "Ajukan proposal dan tunggu semester depan.",
      "C": "Metode Station Rotation: Bagi kelompok, satu kelompok nonton di laptop Anda, yang lain aktivitas fisik, lalu tukar posisi.",
      "D": "Minta siswa bawa HP sendiri (langgar aturan)."
    },
    "poin": {
      "A": 1,
      "B": 3,
      "C": 5,
      "D": 2
    }
  },
  {
    "id": "Q4.2",
    "dimensi": "Empowered Agency (Agensi Guru)",
    "skenario": "Guru senior skeptis dengan AI (ChatGPT) dianggap alat menyontek. Anda tahu manfaatnya untuk RPP.",
    "pertanyaan": "Posisi Anda sebagai Teacher Leader?",
    "opsi": {
      "A": "Pakai diam-diam untuk kerjaan sendiri.",
      "B": "Adakan sesi 'Berbagi Praktik Baik' 15 menit, demokan cara AI bantu administrasi (bukan gantikan guru) untuk ubah persepsi.",
      "C": "Debat dengan senior.",
      "D": "Lapor pengawas minta pelatihan wajib."
    },
    "poin": {
      "A": 2,
      "B": 5,
      "C": 1,
      "D": 3
    }
  },
  {
    "id": "Q4.3",
    "dimensi": "Empowered Agency (Agensi Guru)",
    "skenario": "Anda menyadari materi TIK di kurikulum sudah usang (masih mengajarkan Ms Word 2007), padahal dunia kerja butuh kolaborasi cloud (GDocs/Canva).",
    "pertanyaan": "Keputusan kurikulum apa yang Anda ambil?",
    "opsi": {
      "A": "Tetap ajar sesuai buku paket agar aman administrasi.",
      "B": "Secara inisiatif menyisipkan materi cloud/Canva sebagai pengayaan ('hack curriculum') tanpa meninggalkan target dasar.",
      "C": "Protes ke Kemdikbud lewat medsos.",
      "D": "Menyuruh siswa les komputer di luar."
    },
    "poin": {
      "A": 2,
      "B": 5,
      "C": 1,
      "D": 1
    }
  }
]
